# People Report Data

In [64]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
#format: [DB_FLAVOR]+[DB_PYTHON_LIBRARY]://[USERNAME]:[PASSWORD]@[DB_HOST]:[PORT]/[DB_NAME]
engine = create_engine('mysql+mysqlconnector://cnguyen:Imq2MPSzsF5wdd8fBGA@hr-api-production-replica.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/humi')

In [2]:
engine_2 = create_engine('mysql+mysqlconnector://ili:f9FqFe93htPT13nzx@humi-data-agg.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/test')

## Women in workforce

### % increase in female hires between 2020 and 2021

In [3]:
# Total new hires
total_hires_query = "select count(`id`),`hired_at` \
from employees \
where `deleted_at` is null and legal_sex is not null and hired_at > '2019-12-31 23:59:59' \
group by YEAR(`hired_at`) \
order by `hired_at`"
pd.read_sql_query(total_hires_query, con=engine)

   count(`id`)            hired_at
0        15660 2020-04-13 00:00:00
1        15671 2021-02-01 00:00:00
2            2 2022-02-21 05:00:00

In [4]:
# Female new hires
Female_hires_query = "select count(`id`),`hired_at` \
from employees \
where `deleted_at` is null and legal_sex = 'F' and hired_at > '2019-12-31 23:59:59' \
group by YEAR(`hired_at`) \
order by `hired_at`"
pd.read_sql_query(Female_hires_query, con=engine)

   count(`id`)   hired_at
0         7038 2020-04-13
1         7212 2021-02-01

### % of gender distribution in terminations 2019, 2020, 2021

In [5]:
employees_query = "select id, company_id, job_id, hired_at, terminated_on, deleted_at, legal_sex from employees where hired_at != '3-01-03 00:00:00' \
and hired_at != '0001-01-20 00:00:00' and hired_at != '0001-08-19 21:54:51' and hired_at != '0021-07-08 05:17:32' and hired_at != '0201-09-01 00:00:00'"
employees = pd.read_sql_query(employees_query, con=engine)

In [6]:
company_bad_re_query = "select id as company_id, deleted_at as c_deleted from companies where deleted_at is not null"
company_bad_re = pd.read_sql_query(company_bad_re_query,con=engine)

In [7]:
employees = employees.merge(company_bad_re, how="left",on="company_id")
employees = employees[employees['c_deleted'].isna()]

In [8]:
employees_terminated_byyear = employees[employees["terminated_on"]>"2018-12-31 23:59:59"]
employees_terminated_byyear = employees_terminated_byyear.astype({'terminated_on':str})
employees_terminated_byyear.terminated_on = employees_terminated_byyear.terminated_on.str[0:4]

In [9]:
employees_terminated_byyear.pivot_table(index="terminated_on", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex           F       M      P    X
terminated_on
2019           1594.0  1811.0  417.0  NaN
2020           3671.0  4198.0  477.0  NaN
2021           3606.0  4750.0  401.0  2.0

### % of gender distribution in terminations by month in 2020, 2021

In [10]:
#employee dynamics by month by gender

In [11]:
employees_hired = employees[employees['hired_at']>'2019-12-31 23:59:59']
employees_hired=employees_hired.astype({'hired_at': str})
employees_hired.hired_at = employees_hired.hired_at.str[0:7]
employees_hired.pivot_table(index="hired_at", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex       F       M     P    X
hired_at
2020-01     679.0   753.0  75.0  1.0
2020-02     491.0   515.0  50.0  NaN
2020-03     490.0   544.0  22.0  NaN
2020-04     319.0   510.0  21.0  NaN
2020-05     397.0   553.0  34.0  NaN
2020-06     545.0   660.0  37.0  NaN
2020-07     659.0   810.0  56.0  1.0
2020-08     806.0   818.0  59.0  NaN
2020-09     868.0   978.0  43.0  1.0
2020-10     781.0   833.0  39.0  NaN
2020-11     781.0   970.0  48.0  NaN
2020-12     524.0   556.0  28.0  NaN
2021-01     981.0  1196.0  57.0  3.0
2021-02     809.0   895.0  48.0  2.0
2021-03    1112.0  1199.0  70.0  2.0
2021-04     952.0  1067.0  31.0  4.0
2021-05    1358.0  1507.0  48.0  5.0
2021-06    1154.0  1327.0  52.0  4.0
2021-07     962.0  1001.0  20.0  2.0
2021-08      69.0   111.0   2.0  1.0
2021-09      14.0    27.0   NaN  NaN
2021-10       1.0     5.0   NaN  NaN
2021-11       1.0     NaN   NaN  NaN
2021-12       NaN     2.0   NaN  NaN
2022-01       NaN     1.0   NaN  NaN
2022-02       NaN     1.0   NaN  NaN

In [12]:
employees_deleted = employees[employees['deleted_at']>'2019-12-31 23:59:59']
employees_deleted=employees_deleted.astype({'deleted_at': str})
employees_deleted.deleted_at = employees_deleted.deleted_at.str[0:7]
employees_deleted.pivot_table(index="deleted_at", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex       F      M     P    X
deleted_at
2020-07       6.0    8.0   8.0  NaN
2020-08      29.0   63.0  62.0  NaN
2020-09      38.0   55.0  10.0  NaN
2020-10      64.0   95.0   3.0  NaN
2020-11      37.0   44.0  15.0  NaN
2020-12      62.0   65.0  15.0  NaN
2021-01      49.0   83.0   5.0  NaN
2021-02      45.0   40.0   7.0  NaN
2021-03     203.0  174.0   8.0  NaN
2021-04      69.0   61.0   8.0  1.0
2021-05      86.0  115.0  21.0  NaN
2021-06      63.0   52.0  12.0  1.0
2021-07      35.0   31.0  11.0  1.0

In [13]:
employees_terminated_bymonth = employees[employees["terminated_on"]>"2019-12-31 23:59:59"]

In [14]:
employees_terminated_bymonth = employees_terminated_bymonth.astype({'terminated_on':str})
employees_terminated_bymonth.terminated_on = employees_terminated_bymonth.terminated_on.str[0:7]

In [15]:
employees_terminated_bymonth.pivot_table(index="terminated_on", columns = "legal_sex", values = "id",aggfunc="count")

legal_sex          F      M      P    X
terminated_on
2020-01        274.0  268.0   76.0  NaN
2020-02        167.0  216.0   32.0  NaN
2020-03        287.0  331.0   92.0  NaN
2020-04        221.0  296.0   46.0  NaN
2020-05        177.0  199.0   24.0  NaN
2020-06        175.0  238.0   24.0  NaN
2020-07        182.0  224.0   17.0  NaN
2020-08        257.0  276.0   28.0  NaN
2020-09        442.0  468.0   35.0  NaN
2020-10        607.0  714.0   40.0  NaN
2020-11        438.0  457.0   33.0  NaN
2020-12        444.0  511.0   30.0  NaN
2021-01        369.0  543.0   33.0  NaN
2021-02        428.0  589.0   22.0  NaN
2021-03        533.0  815.0   29.0  NaN
2021-04        476.0  682.0   24.0  1.0
2021-05        605.0  684.0  222.0  NaN
2021-06        594.0  832.0   38.0  NaN
2021-07        600.0  605.0   33.0  1.0
2021-08          1.0    NaN    NaN  NaN

### % of C-Suite positions held by women

In [16]:
jobs_query = "select id, company_id, title from jobs where deleted_at is null"
jobs = pd.read_sql_query(jobs_query, con=engine)
jobs_df = jobs.copy()

In [17]:
jobs_df = jobs_df.rename(columns={"id":"job_id"})

In [18]:
combined = employees.merge(jobs_df, how="left", on = "job_id")

In [19]:
combined_df = combined.copy()

In [20]:
combined_df

,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title
0,1,2,62.0,2018-04-01 00:00:00,NaT,NaT,M,NaT,2.0,GOD
1,176,2,62.0,2018-05-14 11:24:30,2018-05-22,2018-06-13 17:42:57,None,NaT,2.0,GOD
2,177,2,62.0,2018-05-14 00:00:00,NaT,2018-05-29 13:09:58,None,NaT,2.0,GOD
3,179,2,62.0,2018-05-16 00:00:00,NaT,NaT,M,NaT,2.0,GOD
4,180,4,76.0,2018-03-01 00:00:00,NaT,2018-08-28 17:57:10,None,NaT,4.0,Administrator
...,...,...,...,...,...,...,...,...,...,...
88551,92899,2602,42111.0,2020-06-10 00:00:00,NaT,NaT,M,NaT,2602.0,Staff
88552,92900,2602,42111.0,2015-11-11 00:00:00,NaT,NaT,M,NaT,2602.0,Staff
88553,92901,2643,42109.0,2020-01-15 05:00:00,NaT,NaT,None,NaT,2643.0,Engineer
88554,92902,2194,34938.0,2021-07-27 06:00:00,NaT,NaT,None,NaT,2194.0,Line Cook
88555,92903,1355,20769.0,2021-08-09 03:00:00,NaT,NaT,None,NaT,1355.0,Practicum Coordinator

In [21]:
import re

In [22]:
combined_df['title'] = combined_df['title'].str.extract(r'(chief)', re.IGNORECASE)

In [23]:
a = combined_df.dropna(subset=['title']).reset_index()

In [24]:
combined_df_2 = combined.copy()

In [25]:
combined_df_2['title'] = combined_df_2['title'].str.extract(r'(\Wc.o$)', re.IGNORECASE)

In [26]:
b = combined_df_2.dropna(subset=['title']).reset_index()

In [27]:
combined_df_3 = combined.copy()

In [28]:
combined_df_3['title'] = combined_df_3['title'].str.extract(r'(^c.o$)', re.IGNORECASE)

In [29]:
c = combined_df_3.dropna(subset=['title']).reset_index()

In [30]:
combined_df_4 = combined.copy()
combined_df_4['title'] = combined_df_4['title'].str.extract(r'(^c.o\W)', re.IGNORECASE)
d = combined_df_4.dropna(subset=['title'])

In [31]:
result = pd.concat([a,b,c,d],ignore_index=True)

In [32]:
result

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title
0,7.0,186,6,84.0,2018-05-23 00:00:00,NaT,2018-06-20 14:28:23,None,NaT,6.0,Chief
1,37.0,228,14,148.0,2016-10-01 00:00:00,NaT,2020-02-28 20:24:13,None,NaT,14.0,Chief
2,50.0,244,5,100.0,2014-04-21 00:00:00,NaT,2018-08-28 17:57:36,None,NaT,5.0,Chief
3,58.0,252,5,107.0,2014-01-01 00:00:00,NaT,2018-08-28 17:57:36,None,NaT,5.0,Chief
4,119.0,314,19,140.0,2014-07-04 00:00:00,NaT,NaT,M,NaT,19.0,Chief
...,...,...,...,...,...,...,...,...,...,...,...
2021,NaN,86391,2418,37645.0,2021-05-01 07:00:00,NaT,2021-06-23 15:55:06,None,NaT,2418.0,CFO
2022,NaN,86548,2434,39670.0,2019-12-01 00:00:00,NaT,NaT,M,NaT,2434.0,COO
2023,NaN,88281,2524,40288.0,2019-01-01 00:00:00,NaT,NaT,None,NaT,2524.0,CEO/
2024,NaN,88685,2556,40473.0,2013-02-11 00:00:00,NaT,NaT,M,NaT,2556.0,CEO/
2025,NaN,91513,2517,41680.0,2020-11-09 00:00:00,NaT,2021-07-21 14:32:49,F,NaT,2517.0,CFO

In [33]:
result_2020 = result[result['hired_at']<'2020-12-31 23:59:59']

result_2020.loc[((result_2020['terminated_on'].isna())&(result_2020['deleted_at'].isna())|
                   (result_2020['terminated_on']>'2020-12-31 23:59:59')
                   |(result_2020['deleted_at']>'2020-12-31 23:59:59')),"live data"] = True
result_2020 = result_2020[result_2020['live data'] == True]
result_2020

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
4,119.0,314,19,140.0,2014-07-04,NaT,NaT,M,NaT,19.0,Chief,True
5,121.0,316,19,142.0,2014-07-04,NaT,NaT,M,NaT,19.0,Chief,True
13,527.0,726,33,30124.0,2012-05-01,NaT,NaT,F,NaT,33.0,Chief,True
15,722.0,946,37,516.0,2011-08-25,NaT,NaT,M,NaT,37.0,Chief,True
16,736.0,960,37,522.0,2011-05-01,NaT,NaT,M,NaT,37.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
2019,NaN,85278,2445,39098.0,2019-03-25,NaT,NaT,M,NaT,2445.0,CSO,True
2022,NaN,86548,2434,39670.0,2019-12-01,NaT,NaT,M,NaT,2434.0,COO,True
2023,NaN,88281,2524,40288.0,2019-01-01,NaT,NaT,None,NaT,2524.0,CEO/,True
2024,NaN,88685,2556,40473.0,2013-02-11,NaT,NaT,M,NaT,2556.0,CEO/,True
2025,NaN,91513,2517,41680.0,2020-11-09,NaT,2021-07-21 14:32:49,F,NaT,2517.0,CFO,True

In [34]:
result_2021 = result[result['hired_at']<'2021-12-31 23:59:59']

result_2021.loc[((result_2021['terminated_on'].isna())&(result_2021['deleted_at'].isna())|
                   (result_2021['terminated_on']>'2021-12-31 23:59:59')
                   |(result_2021['deleted_at']>'2021-12-31 23:59:59')),"live data"] = True
result_2021 = result_2021[result_2021['live data'] == True]
result_2021

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
4,119.0,314,19,140.0,2014-07-04,NaT,NaT,M,NaT,19.0,Chief,True
5,121.0,316,19,142.0,2014-07-04,NaT,NaT,M,NaT,19.0,Chief,True
13,527.0,726,33,30124.0,2012-05-01,NaT,NaT,F,NaT,33.0,Chief,True
15,722.0,946,37,516.0,2011-08-25,NaT,NaT,M,NaT,37.0,Chief,True
16,736.0,960,37,522.0,2011-05-01,NaT,NaT,M,NaT,37.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
2018,NaN,85213,2445,39119.0,2021-01-25,NaT,NaT,M,NaT,2445.0,CSO,True
2019,NaN,85278,2445,39098.0,2019-03-25,NaT,NaT,M,NaT,2445.0,CSO,True
2022,NaN,86548,2434,39670.0,2019-12-01,NaT,NaT,M,NaT,2434.0,COO,True
2023,NaN,88281,2524,40288.0,2019-01-01,NaT,NaT,None,NaT,2524.0,CEO/,True
2024,NaN,88685,2556,40473.0,2013-02-11,NaT,NaT,M,NaT,2556.0,CEO/,True

In [35]:
Female_leader_2021 = result_2021[result_2021['legal_sex']=="F"]

In [36]:
Female_leader_2021

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
13,527.0,726,33,30124.0,2012-05-01 00:00:00,NaT,NaT,F,NaT,33.0,Chief,True
18,825.0,1062,56,568.0,2018-01-01 00:00:00,NaT,NaT,F,NaT,56.0,Chief,True
22,838.0,1076,52,575.0,2017-05-25 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
25,854.0,1092,52,577.0,2013-11-01 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
32,1419.0,1720,52,574.0,2018-08-13 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
1990,NaN,48450,1622,25808.0,2020-05-18 00:00:00,NaT,NaT,F,NaT,1622.0,CFO/,True
1998,NaN,58315,219,12373.0,2015-09-01 00:00:00,NaT,NaT,F,NaT,219.0,CEO,True
1999,NaN,59668,1953,28994.0,2020-01-01 00:00:00,NaT,NaT,F,NaT,1953.0,"COO,",True
2006,NaN,75243,2307,35215.0,2017-07-01 07:00:00,NaT,NaT,F,NaT,2307.0,CEO,True
2008,NaN,76236,2354,35713.0,2019-04-01 00:00:00,NaT,NaT,F,NaT,2354.0,"CEO,",True

In [37]:
Female_leader_2020 = result_2020[result_2020['legal_sex']=="F"]

In [38]:
Female_leader_2020

,index,id,company_id_x,job_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,company_id_y,title,live data
13,527.0,726,33,30124.0,2012-05-01 00:00:00,NaT,NaT,F,NaT,33.0,Chief,True
18,825.0,1062,56,568.0,2018-01-01 00:00:00,NaT,NaT,F,NaT,56.0,Chief,True
22,838.0,1076,52,575.0,2017-05-25 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
25,854.0,1092,52,577.0,2013-11-01 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
32,1419.0,1720,52,574.0,2018-08-13 00:00:00,NaT,NaT,F,NaT,52.0,Chief,True
...,...,...,...,...,...,...,...,...,...,...,...,...
1998,NaN,58315,219,12373.0,2015-09-01 00:00:00,NaT,NaT,F,NaT,219.0,CEO,True
1999,NaN,59668,1953,28994.0,2020-01-01 00:00:00,NaT,NaT,F,NaT,1953.0,"COO,",True
2006,NaN,75243,2307,35215.0,2017-07-01 07:00:00,NaT,NaT,F,NaT,2307.0,CEO,True
2008,NaN,76236,2354,35713.0,2019-04-01 00:00:00,NaT,NaT,F,NaT,2354.0,"CEO,",True
2025,NaN,91513,2517,41680.0,2020-11-09 00:00:00,NaT,2021-07-21 14:32:49,F,NaT,2517.0,CFO,True

### How female leadership impacts gender distribution in companies

In [39]:
combined_2020 = combined[combined['hired_at']<'2020-12-31 23:59:59']

combined_2020.loc[((combined_2020['terminated_on'].isna())&(combined_2020['deleted_at'].isna())|
                   (combined_2020['terminated_on']>'2020-12-31 23:59:59')
                   |(combined_2020['deleted_at']>'2020-12-31 23:59:59')),"live data"] = True
combined_2020 = combined_2020[combined_2020['live data'] == True]

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [40]:
combined_2021 = combined[combined['hired_at']<'2021-12-31 23:59:59']

combined_2021.loc[((combined_2021['terminated_on'].isna())&(combined_2021['deleted_at'].isna())|
                   (combined_2021['terminated_on']>'2021-12-31 23:59:59')
                   |(combined_2021['deleted_at']>'2021-12-31 23:59:59')),"live data"] = True
combined_2021 = combined_2021[combined_2021['live data'] == True]

In [41]:
combined_2020.loc[(combined_2020['company_id_x'].isin(Female_leader_2020['company_id_x'])),"all C-Suite"] = True

In [42]:
combined_2021.loc[(combined_2021['company_id_x'].isin(Female_leader_2021['company_id_x'])),"all C-Suite"] = True

In [43]:
Female_company_2020 = combined_2020.loc[combined_2020['all C-Suite'] == True]

In [44]:
Female_company_2021 = combined_2021.loc[combined_2021['all C-Suite'] == True]

In [45]:
Female_company_2021["legal_sex"].value_counts()

F    5696
M    4798
P     280
X       7
Name: legal_sex, dtype: int64

In [46]:
Female_company_2020["legal_sex"].value_counts()

F    4840
M    4077
P     468
X       2
Name: legal_sex, dtype: int64

In [47]:
Male_company_2020 = combined_2020.loc[combined_2020['all C-Suite'] != True]

In [48]:
Male_company_2021 = combined_2021.loc[combined_2021['all C-Suite'] != True]

In [49]:
Male_company_2021["legal_sex"].value_counts()

M    19381
F    15594
P     1535
X       21
Name: legal_sex, dtype: int64

In [50]:
Male_company_2020["legal_sex"].value_counts()

M    17042
F    13130
P     1490
X        8
Name: legal_sex, dtype: int64

### Gender distribution by province 2021

join address, company and employee datasets

In [51]:
# address_query = "select id, `province` from addresses \
# where `deleted_at` is NULL and country = 'Canada'"
# address = pd.read_sql_query(address_query, con=engine)
# address = address.rename(columns={"id":"address_id"})
# address = address.astype({"address_id": str})

In [52]:
company_query = "select id, primary_address_id,industry from companies where deleted_at is null and is_locked = '0'"
company = pd.read_sql_query(company_query, con=engine)
company = company.rename(columns={"id":"company_id","primary_address_id":"address_id"})
company = company.astype({"company_id":str,"address_id":str})
company['address_id'] = company.apply(lambda x:x['address_id'].split('.')[0], axis=1)

In [53]:
employee_query = "select id, company_id, legal_sex, account_id from employees \
where deleted_at is null and terminated_on is null and legal_sex is not null"
employee = pd.read_sql_query(employee_query, con=engine)
employee = employee.rename(columns={"id":"employee_id"})
employee = employee.astype({"company_id": str,"employee_id":str})

In [54]:
#company_address = company.merge(address, how = "left", on = "address_id")

In [55]:
#employee_address = employee.merge(company_address, how = "left", on = "company_id")

In [56]:
#employee_address.groupby(["legal_sex","province"],as_index=False)["account_id"].nunique()

### % of women in the tech workforce 2021

In [57]:
company_df = company.copy()

In [58]:
company_df['industry'] = company_df['industry'].str.extract(r'(software|information|^tech|^it|Cyber|internet|gam)',re.IGNORECASE)

In [59]:
company_df = company_df.dropna(subset=['industry']).reset_index()

In [60]:
company_df_employee = employee.merge(company_df, how = "left", on = "company_id" ).dropna(subset=['industry']).reset_index()

In [62]:
company_df_employee.groupby(["legal_sex"],as_index=False)["account_id"].nunique()

  legal_sex  account_id
0         F        7327
1         M        9082
2         P         661
3         X           9

### % of termination due to covid

In [65]:
total_termination_query = "select count(termination_comments) from terminations \
where termination_comments is not null and terminated_at between '2018-12-31 23:59:59' and '2021-12-31 23:59:59' \
group by year(terminated_at) order by terminated_at"
pd.read_sql_query(total_termination_query,con=engine)

   count(termination_comments)
0                          142
1                         9498
2                        10215

In [66]:
covid_termination_query = "select count(termination_comments),terminated_at from terminations \
where termination_comments like '%covid%' \
and terminated_at between '2018-12-31 23:59:59' and '2021-12-31 23:59:59' \
group by year(terminated_at) order by terminated_at"
pd.read_sql_query(covid_termination_query,con=engine)

   count(termination_comments) terminated_at
0                          676    2020-04-14
1                          487    2021-01-11